1757. Recyclable and Low Fat Products

In [ ]:
select product_id
from Products
where low_fats = 'Y' and recyclable = 'Y';

584. Find Customer Referee

In [ ]:
select name 
from Customer
where referee_id <> 2 or referee_id is null;

595. Big Countries

In [ ]:
select name, population, area
from World
where area >= 3000000 or population >= 25000000;

1148. Article Views I

In [ ]:
select distinct author_id as id
from Views
where author_id = viewer_id
order by author_id asc;

1683. Invalid Tweets

In [ ]:
select tweet_id
from Tweets
where length(content) > 15;

1378. Replace Employee ID With The Unique Identifier

In [ ]:
select unique_id, name
from Employees a
left join EmployeeUNI b
on a.id = b.id;

1068. Product Sales Analysis I

In [ ]:
select b.product_name, a.year, a.price
from Sales a 
left join Product b 
on a.product_id = b.product_id;

1581. Customer Who Visited but Did Not Make Any Transactions

In [ ]:
select customer_id, count(*) as count_no_trans
from Visits a
left join Transactions b
on a.visit_id = b.visit_id
where transaction_id is null
group by customer_id;

197. Rising Temperature

In [ ]:
select a.id
from Weather a
left join Weather b
on a.recordDate = date_add(b.recordDate, interval 1 day)
where a.temperature > b.temperature;

In [ ]:
# lag function only can be used in same time difference

# select id
# from 
#     (select *, 
#             lag(temperature, 1) over (order by recordDate asc) as pre_temp
#      from Weather) as a
# where temperature > pre_temp

1661. Average Time of Process per Machine

In [ ]:
select a.machine_id, round(avg(b.timestamp - a.timestamp), 3) as processing_time
from Activity a
inner join Activity b
on a.machine_id = b.machine_id 
and a.process_id = b.process_id
and a.activity_type = 'start' and b.activity_type = 'end'
group by a.machine_id

In [ ]:
# select machine_id, round(avg(processing_time), 3) as processing_time
# from (
#     select machine_id, process_id, 
#         (max(timestamp) - min(timestamp)) as processing_time
#     from Activity
#     group by machine_id, process_id) a
# group by machine_id

577. Employee Bonus

In [ ]:
select a.name, b.bonus 
from Employee a
left join Bonus b
on a.empId = b.empId
where b.bonus < 1000 or b.bonus is null;

1280. Students and Examinations

In [ ]:
select a.*, count(b.subject_name) as attended_exams
from (select * from Students cross join Subjects) a
left join Examinations b
on a.student_id = b.student_id
and a.subject_name = b.subject_name
group by 1, 2, 3
order by 1, 3;

570. Managers with at Least 5 Direct Reports

In [ ]:
select a.name
from Employee a
left join Employee b on a.id = b.managerId
group by a.id
having count(*) >= 5


# select name
# from Employee
# where id in (select managerId 
#              from Employee
#              group by managerId
#              having count(*) >= 5)
# group by id;

1934. Confirmation Rate

In [ ]:
select a.user_id, 
       ifnull(round(sum(b.action = 'confirmed') / count(b.action), 2), 0) as confirmation_rate
from Signups a
left join Confirmations b
on a.user_id = b.user_id
group by a.user_id;

620. Not Boring Movies

In [ ]:
select *
from Cinema
where id % 2 = 1
and description <> 'boring'
order by rating desc

1251. Average Selling Price

In [ ]:
select a.product_id, 
       ifnull(round(sum(a.price * b.units) / sum(b.units), 2), 0) as average_price
from Prices a
left join UnitsSold b
on a.product_id = b.product_id
and b.purchase_date between a.start_date and a.end_date
group by a.product_id;

1075. Project Employees I

In [ ]:
select project_id, round(avg(b.experience_years), 2) as average_years
from Project a
left join Employee b
on a.employee_id = b.employee_id
group by project_id;

1633. Percentage of Users Attended a Contest

In [ ]:
select a.contest_id, round((count(*)/total_user)*100, 2) as percentage
from Register a
join (
    select count(distinct user_id) as total_user from Users
) b
group by a.contest_id
order by percentage desc, a.contest_id asc;

1211. Queries Quality and Percentage

In [ ]:
select query_name, round(avg(rating/position), 2) as quality,
       round((sum(case when rating < 3 then 1 else 0 end)/count(*))*100, 2) as poor_query_percentage
from Queries
where query_name is not null
group by query_name;

1193. Monthly Transactions I

In [ ]:
select date_format(trans_date, '%Y-%m') as month, country,
       count(*) as trans_count,
       sum(case when state = 'approved' then 1 else 0 end) as approved_count,
       sum(amount) as trans_total_amount,
       sum(case when state = 'approved' then amount else 0 end) as approved_total_amount
from Transactions
group by month, country;

1174. Immediate Food Delivery II

In [ ]:
select round(avg(order_date = customer_pref_delivery_date)*100, 2) as immediate_percentage
from (
    select *, rank() over(partition by customer_id order by order_date) as order_no
    from Delivery
) a
where order_no = 1


# select round(sum(case when order_date = customer_pref_delivery_date then 1 else 0 end)/count(*) *100, 2) as immediate_percentage
# from (
#     select *, rank() over(partition by customer_id order by order_date) as ranking
#     from Delivery) a
# where ranking = 1;

In [ ]:
# select round(sum(case when order_date = customer_pref_delivery_date then 1 else 0 end) / count(*) *100, 2) as immediate_percentage
# from(
#     select customer_id, min(order_date) as first_order_date
#     from Delivery
#     group by customer_id) a
# left join Delivery b
# on a.customer_id = b.customer_id and a.first_order_date = b.order_date;

550. Game Play Analysis IV

In [ ]:
select round(count(distinct b.player_id)/count(distinct a.player_id), 2) as fraction
from (
    select player_id, min(event_date) as first_date
    from Activity
    group by player_id
) a
left join Activity b 
on first_date = date_sub(b.event_date, interval 1 day) and a.player_id = b.player_id


# select round(count(player_id)/(select count(distinct player_id) from Activity), 2) as fraction
# from Activity
# where (player_id, date_sub(event_date, interval 1 day)) in 
#     (select player_id, min(event_date) as first_event_date 
#     from Activity
#     group by player_id);

In [ ]:
# select round(
#     (select count(distinct a.player_id)
#     from (
#         select player_id, min(event_date) as first_event_date
#         from Activity
#         group by player_id) a
#     inner join Activity b
#     on a.player_id = b.player_id
#     and date_add(a.first_event_date, interval 1 day) = b.event_date) / 
#     (select count(distinct player_id) from Activity), 2) as fraction;

2356. Number of Unique Subjects Taught by Each Teacher

In [ ]:
select teacher_id, count(distinct subject_id) as cnt
from Teacher
group by teacher_id;

1141. User Activity for the Past 30 Days I

In [ ]:
select activity_date as day, count(distinct user_id) as active_users
from Activity
where activity_date between date_sub('2019-07-27', interval 29 day) and '2019-07-27'
group by activity_date

1070. Product Sales Analysis III

In [ ]:
select product_id, year as first_year, quantity, price
from Sales
where (product_id, year) in 
(select product_id, min(year) from Sales group by product_id);

In [ ]:
# select a.*, b.quantity, b.price
# from(
#     select product_id, min(year) as first_year
#     from Sales
#     group by product_id) a
# inner join Sales b
# on a.product_id = b.product_id
# and a.first_year = b.year;

596. Classes More Than 5 Students

In [ ]:
select class
from Courses
group by class
having count(student) >= 5;

1729. Find Followers Count

In [ ]:
select user_id, count(follower_id) as followers_count
from Followers
group by user_id
order by user_id;

619. Biggest Single Number

In [ ]:
select max(num) as num
from (
    select num
    from MyNumbers
    group by num
    having count(*) = 1) a;

1045. Customers Who Bought All Products

In [ ]:
with prod as (
    select count(*) as prod_cnt
    from Product)

select customer_id
from Customer, prod
group by customer_id
having count(distinct product_key) = (select prod_cnt from prod)

In [ ]:
# select a.customer_id
# from Customer a
# join Product b
# on a.product_key = b.product_key
# group by a.customer_id
# having count(distinct a.product_key) = (select count(*) from Product)

1731. The Number of Employees Which Report to Each Employee

In [ ]:
select a.employee_id, a.name, count(*) as reports_count, round(avg(b.age)) as average_age
from Employees a
inner join Employees b
on a.employee_id = b.reports_to
group by a.employee_id, a.name
order by a.employee_id

1789. Primary Department for Each Employee

In [ ]:
select b.employee_id, b.department_id
from(
    select employee_id, count(*) as dep_cnt
    from Employee
    group by employee_id) a
left join Employee b
on a.employee_id = b.employee_id
where dep_cnt = 1 or primary_flag = 'Y'

610. Triangle Judgement

In [ ]:
select *,
(case when (x + y > z) and (y + z > x) and (x + z > y) then 'Yes' else 'No' end) as triangle
from Triangle

180. Consecutive Numbers

In [ ]:
with num_seq as 
(select num, 
        lead(num, 1) over (order by id) as num_1,
        lead(num, 2) over (order by id) as num_2
 from Logs)

 select distinct num as ConsecutiveNums
 from num_seq
 where num = num_1 and num = num_2

In [ ]:
# select count(distinct a.id) as ConsecutiveNums
# from Logs a
# inner join Logs b on a.id = b.id - 1
# inner join Logs c on a.id = c.id - 2
# where a.num = b.num and a.num = c.num

1164. Product Price at a Given Date

In [ ]:
select distinct a.product_id, 
      (case when ranking = 1 then b.new_price else 10 end) as price
from Products a
left join (
    select *, rank() over(partition by product_id order by change_date desc) as ranking
    from Products
    where change_date <= '2019-08-16') b
on a.product_id = b.product_id
where ranking = 1 or ranking is null

1204. Last Person to Fit in the Bus

In [ ]:
with queue_weight as (
    select person_name, turn, sum(weight) over(order by turn asc) as accu_weight
    from Queue
)

select person_name
from queue_weight
where accu_weight <= 1000
order by turn desc
limit 1

1907. Count Salary Categories

In [ ]:
select 'Low Salary' as category,
       sum(income < 20000) as accounts_count
from Accounts
union all
select 'Average Salary' as category,
       sum(income between 20000 and 50000) as accounts_count
from Accounts
union all
select 'High Salary' as category,
       sum(income > 50000) as accounts_count
from Accounts

1978. Employees Whose Manager Left the Company

In [ ]:
select employee_id
from Employees 
where salary < 30000
and manager_id not in (select employee_id from Employees)
order by employee_id

In [ ]:
# select a.employee_id
# from Employees a
# left join Employees b
# on a.manager_id = b.employee_id
# where a.salary < 30000 
# and a.manager_id is not null and b.employee_id is null
# order by a.employee_id

626. Exchange Seats

In [ ]:
select 
(case when id % 2 = 0 then id - 1
      when id % 2 != 0 and id = (select count(*) from Seat) then id
      else id + 1 end) as id, student
from Seat
order by id

In [ ]:
# select a.id, 
#     (case when b.student is null then a.student else b.student end) as student
# from (
#     select *,
#         (case when id % 2 = 0 then id - 1 else id + 1 end ) as new_id
#     from Seat ) a
# left join Seat b
# on a.new_id = b.id

1341. Movie Rating

In [ ]:
(select name as results
from MovieRating a
left join Users b on a.user_id = b.user_id
group by a.user_id
order by count(*) desc, name asc
limit 1)

union all

(select title as results
from MovieRating a
left join Movies b on a.movie_id = b.movie_id
where date_format(created_at, '%Y-%m') = '2020-02'
group by a.movie_id
order by avg(rating) desc, title asc
limit 1)

1321. Restaurant Growth

In [ ]:
with daily_sum as (
    select visited_on, sum(amount) as amount
    from Customer
    group by visited_on);

select *
from(
    select visited_on, 
    sum(amount) over(order by visited_on range between interval 6 day preceding and current row) as amount,
    round(avg(amount) over(order by visited_on range between interval 6 day preceding and current row), 2) as average_amount
    from daily_sum
    group by visited_on
) a
where visited_on >= (select min(visited_on) + interval 6 day from daily_sum);

602. Friend Requests II: Who Has the Most Friends

In [ ]:
select id, count(*) as num
from(
    (select requester_id as id from RequestAccepted)
    union all
    (select accepter_id as id from RequestAccepted)
) a
group by id
order by num desc
limit 1

585. Investments in 2016

In [ ]:
select round(sum(tiv_2016), 2) as tiv_2016
from Insurance
where tiv_2015 in (
    select tiv_2015
    from Insurance
    group by tiv_2015
    having count(*) > 1)
and (lat, lon) not in (
    select lat, lon
    from Insurance
    group by lat, lon
    having count(*) > 1)

1667. Fix Names in a Table

In [ ]:
select user_id, 
concat(upper(substring(name, 1, 1)), lower(substring(name, 2))) as name
from Users
order by user_id

1527. Patients With a Condition

In [ ]:
select *
from Patients
where conditions like 'DIAB1%' or conditions like '% DIAB1%'

196. Delete Duplicate Emails

In [ ]:
delete a 
from Person a
inner join Person b
where a.email = b.email and a.id > b.id

176. Second Highest Salary

In [ ]:
select max(salary) as SecondHighestSalary
from Employee
where salary < (select max(salary) from Employee)

1484. Group Sold Products By The Date

In [ ]:
select sell_date, 
    count(distinct product) as num_sold,
    group_concat(distinct product order by product asc separator ',') as products
from Activities
group by sell_date
order by sell_date

In [ ]:
# select sell_date, 
#     count(distinct product) as num_sold,
#     string_agg(distinct product, ', ' order by product) as products
# from Activities
# group by sell_date

1327. List the Products Ordered in a Period

In [ ]:
select product_name, sum(unit) as unit
from Products a
left join Orders b
on a.product_id = b.product_id
where date_format(order_date, '%Y-%m') = '2020-02'
group by product_name
having unit >= 100

1517. Find Users With Valid E-Mails

In [ ]:
select *
from users
where mail regexp '^[A-Za-z][A-Za-z0-9_.-]*@leetcode[.]com$'

# ^ asserts the start of the string.
# [A-Za-z] ensures the string starts with an alphabetical character.
# [A-Za-z0-9._-]* matches zero or more letters, digits, underscores, periods, or dashes.
# @leetcode.com specifies the domain exactly.
# $ asserts the end of the string.

185. Department Top Three Salaries

In [ ]:
select b.name as Department, a.name as Employee, salary
from(
    select *,
        dense_rank() over(partition by departmentId order by salary desc) as ranking
    from Employee) a
left join Department b on a.departmentId = b.id
where a.ranking <= 3